{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите первое число: g\n",
      "Введите операцию: h\n",
      "Введите второе число: k\n",
      "Введите первое число: 3\n",
      "Введите операцию: /\n",
      "Введите второе число: 9\n",
      "3 / 9 = 0.3333333333333333\n",
      "Введите первое число: 1\n",
      "Введите операцию: 0\n",
      "Введите второе число: 5\n"
     ]
    }
   ],
   "source": [
    "__author__ = 'Алексей Сидорюк'\n",
    "\n",
    "'''\n",
    "Примечание:\n",
    "1. Постарайтесь решить задачи без использования массивов. Им будет посвящён следующий урок.\n",
    "'''\n",
    "\n",
    "# 1. Написать программу, которая будет складывать, вычитать, умножать или делить два числа.\n",
    "# Числа и знак операции вводятся пользователем. После выполнения вычисления программа не должна завершаться,\n",
    "# а должна запрашивать новые данные для вычислений. Завершение программы должно выполняться при вводе символа '0'\n",
    "# в качестве знака операции. Если пользователь вводит неверный знак (не '0', '+', '-', '*', '/'),\n",
    "# то программа должна сообщать ему об ошибке и снова запрашивать знак операции.\n",
    "# Также сообщать пользователю о невозможности деления на ноль, если он ввел 0 в качестве делителя.\n",
    "\n",
    "def calc():\n",
    "    num1 = input('Введите первое число: ')\n",
    "    oper = input('Введите операцию: ')\n",
    "    num2 = input('Введите второе число: ')\n",
    "    if num1.isdigit() and num1.isdigit(): # пока будем работать только с целыми числами\n",
    "        if oper == '0':\n",
    "            return\n",
    "        elif oper == '+':\n",
    "            print('{} + {} = {}'.format(num1, num2, int(num1) + int(num2)))\n",
    "            return calc()\n",
    "        elif oper == '-':\n",
    "            print('{} - {} = {}'.format(num1, num2, int(num1) - int(num2)))\n",
    "            return calc()\n",
    "        elif oper == '*':\n",
    "            print('{} * {} = {}'.format(num1, num2, int(num1) * int(num2)))\n",
    "            return calc()\n",
    "        elif oper == '/':\n",
    "            if int(num2) != 0:\n",
    "                print('{} / {} = {}'.format(num1, num2, int(num1) / int(num2)))\n",
    "            else:\n",
    "                print('Деление на 0.')\n",
    "            return calc()\n",
    "        else:\n",
    "            print('Неправильный знак операции.')\n",
    "            return calc()\n",
    "    else:\n",
    "        return calc()\n",
    "\n",
    "calc()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "34701675482982\n",
      "Введенное число содержит 8 четных и 6 нечетных цифр.\n"
     ]
    }
   ],
   "source": [
    "# 2. Посчитать четные и нечетные цифры введенного натурального числа.\n",
    "# Например, если введено число 34560, то у него 3 четные цифры (4, 6 и 0) и 2 нечетные (3 и 5).\n",
    "\n",
    "even = 0\n",
    "odd = 0\n",
    "num = input()\n",
    "\n",
    "if num.isnumeric():\n",
    "    for i in num:\n",
    "        if i.isnumeric():\n",
    "            if int(i)%2:\n",
    "                odd += 1\n",
    "            else:\n",
    "                even += 1\n",
    "    print ('Введенное число содержит {} четных и {} нечетных цифр.'.format(even, odd))\n",
    "else:\n",
    "    print('Введено не целое число.')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите целое число (последовательность цифр):12367327\n",
      "Обратная последовательность: 72376321\n"
     ]
    }
   ],
   "source": [
    "# 3. Сформировать из введенного числа обратное по порядку входящих в него цифр и вывести на экран.\n",
    "# Например, если введено число 3486, то надо вывести число 6843.\n",
    "# О том, что строки - объект итерируемый, забыли. Реверс рекурсивный.\n",
    "\n",
    "def reverse_num(num_str, num_position):\n",
    "    if int(num_str) >= 0:\n",
    "        # базовый случай - дошли до конца строки (разряд единиц в представлении целого цисла)\n",
    "        if num_position == 1:\n",
    "            return str(int(num_str) % 10**num_position // 10**(num_position - 1))\n",
    "        else:\n",
    "            return reverse_num(num_str, num_position - 1) + str(int(num_str) % 10**num_position // 10**(num_position - 1))\n",
    "    else:\n",
    "        return '-' + reverse_num(str(abs(int(num_str))), num_position - 2) + str(abs(int(num_str)) % 10**(num_position - 1) // 10**(num_position - 2))\n",
    "\n",
    "num_str = input('Введите целое число (последовательность цифр):')\n",
    "\n",
    "print('Обратная последовательность: ' + reverse_num(num_str, len(num_str)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите количество элементов ряда: 500\n",
      "0.6666666666666667\n"
     ]
    }
   ],
   "source": [
    "# 4. Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...Количество элементов (n) вводится с клавиатуры.\n",
    "\n",
    "def sum_series(n):\n",
    "    if n == 0:\n",
    "        return (-1/2)**n\n",
    "    elif n > 0:\n",
    "        return (-1/2)**n + sum_series(n - 1)\n",
    "\n",
    "n = input('Введите количество элементов ряда: ')\n",
    "print(sum_series(int(n)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\"32- \"  \"33-!\"  \"34-\"\"  \"35-#\"  \"36-$\"  \"37-%\"  \"38-&\"  \"39-'\"  \"40-(\"  \"41-)\"  \n",
      "\"42-*\"  \"43-+\"  \"44-,\"  \"45--\"  \"46-.\"  \"47-/\"  \"48-0\"  \"49-1\"  \"50-2\"  \"51-3\"  \n",
      "\"52-4\"  \"53-5\"  \"54-6\"  \"55-7\"  \"56-8\"  \"57-9\"  \"58-:\"  \"59-;\"  \"60-<\"  \"61-=\"  \n",
      "\"62->\"  \"63-?\"  \"64-@\"  \"65-A\"  \"66-B\"  \"67-C\"  \"68-D\"  \"69-E\"  \"70-F\"  \"71-G\"  \n",
      "\"72-H\"  \"73-I\"  \"74-J\"  \"75-K\"  \"76-L\"  \"77-M\"  \"78-N\"  \"79-O\"  \"80-P\"  \"81-Q\"  \n",
      "\"82-R\"  \"83-S\"  \"84-T\"  \"85-U\"  \"86-V\"  \"87-W\"  \"88-X\"  \"89-Y\"  \"90-Z\"  \"91-[\"  \n",
      "\"92-\\\"  \"93-]\"  \"94-^\"  \"95-_\"  \"96-`\"  \"97-a\"  \"98-b\"  \"99-c\"  \"100-d\"  \"101-e\"  \n",
      "\"102-f\"  \"103-g\"  \"104-h\"  \"105-i\"  \"106-j\"  \"107-k\"  \"108-l\"  \"109-m\"  \"110-n\"  \"111-o\"  \n",
      "\"112-p\"  \"113-q\"  \"114-r\"  \"115-s\"  \"116-t\"  \"117-u\"  \"118-v\"  \"119-w\"  \"120-x\"  \"121-y\"  \n",
      "\"122-z\"  \"123-{\"  \"124-|\"  \"125-}\"  \"126-~\"  \"127-\"  \n"
     ]
    }
   ],
   "source": [
    "# 5. Вывести на экран коды и символы таблицы ASCII, начиная с символа под номером 32 и заканчивая 127-м включительно.\n",
    "# Вывод выполнить в табличной форме: по десять пар \"код-символ\" в каждой строке.\n",
    "\n",
    "row = ''\n",
    "for i in range(32,128):\n",
    "    row += '\"' + str(i) + '-' + chr(i) + '\"  '\n",
    "    if (i-1)%10 == 0:\n",
    "        print(row, end='\\n')\n",
    "        row = ''\n",
    "print(row)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
